///=====================================================================
//文件名称：Temp_.c文件
//制作单位：SD-Arm(sumcu.suda.edu.cn)
//更新记录：20220321-20220328
//移植规则：【固定】
///=====================================================================
#include "tempRegression.h"
#include "math.h"

//============================================================================
//函数名称：tempRegression
//功能概要：将读到的外部热敏电阻AD值转换为实际温度
//参数说明：tempAD：通过adc_ave函数得到的AD值
//函数返回：实际温度值
//============================================================================
float tempRegression(uint16_t tempAD)
{
     float Vtemp,Rtemp,temp;
    if(tempAD<=72)
    {
       return -274;
    }
    Vtemp = (tempAD*3300.0)/4096;
    Rtemp = Vtemp/(3300.0 - Vtemp)*10000.0;
    temp = (1/(log(Rtemp/10000.0)/3950.0 + (1/(273.15 + 25)))) - 273.15 + 0.5; 
    return temp; 
}
