///=====================================================================
//文件名称：emuart.h文件
//制作单位：SD-Arm(sumcu.suda.edu.cn)
//更新记录：20200831-20200904
//移植规则：【固定】
///=====================================================================

#ifndef __ADC_TEMP_REGRESSION_H
#define __ADC_TEMP_REGRESSION_H

#include "string.h"
#include "uart.h"
#include "flash.h"
#include "mcu.h"
#include "adc.h"
#include "user.h"

//=======================构件使用步骤开始================================
//（1）将本构件中的emuart_recv函数放入相应的串口中断中，并保存返回值到全局变量中。
//（2）在主函数中调用emuart_init函数完成初始化。
//（3）在有发送数据需要时，根据需要调用emuart_send1、emuart_sendN
//          或emuart_send_string函数发送数据。
//（4）在主程序中，通过判断emuart_recv的返回值是否为零判断是否接收到数据并处理。
//=======================构件使用步骤结束================================


//============================================================================
//函数名称：tempRegression
//功能概要：将读到的外部热敏电阻AD值转换为实际温度
//参数说明：tempAD：通过adc_ave函数得到的AD值
//函数返回：实际温度值
//============================================================================
float tempRegression(uint16_t tempAD);


#endif
